; domain
(define (domain navigation)
  (:requirements :strips)
  (:predicates
    (at-player ?l )
    (h-adjacent ?l1 ?l2)
    (v-adjacent ?l1 ?l2)
    (at-wall ?l)
  )

(:types
  position 
)

  ;; Move Player Up
  (:action up
    :effect (forall (?l1 ?l2 - position) (when (and (at-player ?l1) 
                       (v-adjacent ?l1 ?l2)
                       (not (at-wall ?l2))        
    ) (and (not (at-player ?l1)) 
                 (at-player ?l2)
            )) )
  )

  ;; Move Player Down
  (:action down
    :effect (forall (?l1 ?l2 - position)
    (when (and (at-player ?l1) 
                       (v-adjacent ?l2 ?l1)
                       (not (at-wall ?l2))
    ) (and (not (at-player ?l1)) 
                 (at-player ?l2)
            ))
     )
  )

  ;; Move Player Left
  (:action left
    :effect (forall (?l1 ?l2 - position) 
    (when (and (at-player ?l1) 
                       (h-adjacent ?l2 ?l1) 
                       (not (at-wall ?l2))
    ) (and (not (at-player ?l1)) 
                 (at-player ?l2)
            ))
    )
  )

  ;; Move Player Right
  (:action right
    :effect (forall (?l1 ?l2 - position)
    (when (and (at-player ?l1) 
                       (h-adjacent ?l1 ?l2) 
                       (not (at-wall ?l2))
    ) 
    (and (not (at-player ?l1)) 
                 (at-player ?l2)
            ))
    )
  )
)

; problem
;; PDDL Instance for C
(define (problem Navigation)
(:domain navigation)
(:objects
    x1_y1 x1_y2 x1_y3 x1_y4 x1_y5 x1_y6 x1_y7 x2_y1 x2_y2 x2_y3 x2_y4 x2_y5 x2_y6 x2_y7 x3_y1 x3_y2 x3_y3 x3_y4 x3_y5 x3_y6 x3_y7 x4_y1 x4_y2 x4_y3 x4_y4 x4_y5 x4_y6 x4_y7 x5_y1 x5_y2 x5_y3 x5_y4 x5_y5 x5_y6 x5_y7 x6_y1 x6_y2 x6_y3 x6_y4 x6_y5 x6_y6 x6_y7 x7_y1 x7_y2 x7_y3 x7_y4 x7_y5 x7_y6 x7_y7 - position
  )
(:init
(at-player x7_y1)

(h-adjacent x1_y1 x2_y1) (h-adjacent x2_y1 x3_y1) (h-adjacent x3_y1 x4_y1) (h-adjacent x4_y1 x5_y1) (h-adjacent x5_y1 x6_y1) (h-adjacent x6_y1 x7_y1)
(h-adjacent x1_y2 x2_y2) (h-adjacent x2_y2 x3_y2) (h-adjacent x3_y2 x4_y2) (h-adjacent x4_y2 x5_y2) (h-adjacent x5_y2 x6_y2) (h-adjacent x6_y2 x7_y2)
(h-adjacent x1_y3 x2_y3) (h-adjacent x2_y3 x3_y3) (h-adjacent x3_y3 x4_y3) (h-adjacent x4_y3 x5_y3) (h-adjacent x5_y3 x6_y3) (h-adjacent x6_y3 x7_y3)
(h-adjacent x1_y4 x2_y4) (h-adjacent x2_y4 x3_y4) (h-adjacent x3_y4 x4_y4) (h-adjacent x4_y4 x5_y4) (h-adjacent x5_y4 x6_y4) (h-adjacent x6_y4 x7_y4)
(h-adjacent x1_y5 x2_y5) (h-adjacent x2_y5 x3_y5) (h-adjacent x3_y5 x4_y5) (h-adjacent x4_y5 x5_y5) (h-adjacent x5_y5 x6_y5) (h-adjacent x6_y5 x7_y5)
(h-adjacent x1_y6 x2_y6) (h-adjacent x2_y6 x3_y6) (h-adjacent x3_y6 x4_y6) (h-adjacent x4_y6 x5_y6) (h-adjacent x5_y6 x6_y6) (h-adjacent x6_y6 x7_y6)
(h-adjacent x1_y7 x2_y7) (h-adjacent x2_y7 x3_y7) (h-adjacent x3_y7 x4_y7) (h-adjacent x4_y7 x5_y7) (h-adjacent x5_y7 x6_y7) (h-adjacent x6_y7 x7_y7)

(v-adjacent x1_y1 x1_y2) (v-adjacent x1_y2 x1_y3) (v-adjacent x1_y3 x1_y4) (v-adjacent x1_y4 x1_y5) (v-adjacent x1_y5 x1_y6) (v-adjacent x1_y6 x1_y7)
(v-adjacent x2_y1 x2_y2) (v-adjacent x2_y2 x2_y3) (v-adjacent x2_y3 x2_y4) (v-adjacent x2_y4 x2_y5) (v-adjacent x2_y5 x2_y6) (v-adjacent x2_y6 x2_y7)
(v-adjacent x3_y1 x3_y2) (v-adjacent x3_y2 x3_y3) (v-adjacent x3_y3 x3_y4) (v-adjacent x3_y4 x3_y5) (v-adjacent x3_y5 x3_y6) (v-adjacent x3_y6 x3_y7)
(v-adjacent x4_y1 x4_y2) (v-adjacent x4_y2 x4_y3) (v-adjacent x4_y3 x4_y4) (v-adjacent x4_y4 x4_y5) (v-adjacent x4_y5 x4_y6) (v-adjacent x4_y6 x4_y7)
(v-adjacent x5_y1 x5_y2) (v-adjacent x5_y2 x5_y3) (v-adjacent x5_y3 x5_y4) (v-adjacent x5_y4 x5_y5) (v-adjacent x5_y5 x5_y6) (v-adjacent x5_y6 x5_y7)
(v-adjacent x6_y1 x6_y2) (v-adjacent x6_y2 x6_y3) (v-adjacent x6_y3 x6_y4) (v-adjacent x6_y4 x6_y5) (v-adjacent x6_y5 x6_y6) (v-adjacent x6_y6 x6_y7)
(v-adjacent x7_y1 x7_y2) (v-adjacent x7_y2 x7_y3) (v-adjacent x7_y3 x7_y4) (v-adjacent x7_y4 x7_y5) (v-adjacent x7_y5 x7_y6) (v-adjacent x7_y6 x7_y7)

(at-wall x4_y7) (at-wall x1_y6) (at-wall x2_y6) (at-wall x5_y6) (at-wall x6_y6) (at-wall x3_y5)
(at-wall x6_y5) (at-wall x1_y4) (at-wall x3_y4) (at-wall x5_y4) (at-wall x5_y3) (at-wall x7_y3)
(at-wall x2_y2) (at-wall x3_y2) (at-wall x4_y2) (at-wall x6_y1)
)
(:goal
(at-player x1_y7)
)
)

; plan
1. (up)
   deleted: (at-player x7_y1)
   added: (at-player x7_y2)
   goals met: 0 of 1
2. (left)
   deleted: (at-player x7_y2)
   added: (at-player x6_y2)
   goals met: 0 of 1
3. (left)
   deleted: (at-player x6_y2)
   added: (at-player x5_y2)
   goals met: 0 of 1
4. (down)
   deleted: (at-player x5_y2)
   added: (at-player x5_y1)
   goals met: 0 of 1
5. (left)
   deleted: (at-player x5_y1)
   added: (at-player x4_y1)
   goals met: 0 of 1
6. (left)
   deleted: (at-player x4_y1)
   added: (at-player x3_y1)
   goals met: 0 of 1
7. (left)
   deleted: (at-player x3_y1)
   added: (at-player x2_y1)
   goals met: 0 of 1
8. (left)
   deleted: (at-player x2_y1)
   added: (at-player x1_y1)
   goals met: 0 of 1
9. (up)
   deleted: (at-player x1_y1)
   added: (at-player x1_y2)
   goals met: 0 of 1
10. (up)
   deleted: (at-player x1_y2)
   added: (at-player x1_y3)
   goals met: 0 of 1
11. (right)
   deleted: (at-player x1_y3)
   added: (at-player x2_y3)
   goals met: 0 of 1
12. (right)
   deleted: (at-player x2_y3)
   added: (at-player x3_y3)
   goals met: 0 of 1
13. (right)
   deleted: (at-player x3_y3)
   added: (at-player x4_y3)
   goals met: 0 of 1
14. (up)
   deleted: (at-player x4_y3)
   added: (at-player x4_y4)
   goals met: 0 of 1
15. (up)
   deleted: (at-player x4_y4)
   added: (at-player x4_y5)
   goals met: 0 of 1
16. (up)
   deleted: (at-player x4_y5)
   added: (at-player x4_y6)
   goals met: 0 of 1
17. (left)
   deleted: (at-player x4_y6)
   added: (at-player x3_y6)
   goals met: 0 of 1
18. (up)
   deleted: (at-player x3_y6)
   added: (at-player x3_y7)
   goals met: 0 of 1
19. (left)
   deleted: (at-player x3_y7)
   added: (at-player x2_y7)
   goals met: 0 of 1
20. (left)
   deleted: (at-player x2_y7)
   added: (at-player x1_y7)
   goals met: 1 of 1
